import java.awt.Image;
import java.util.Calendar;
import java.util.HashMap;
import java.util.Random;

public class UserDummy {

	public static void main(String[] args) {

		Random rnd = new Random();

//		String[] first_name = { "김", "이", "박", "최", "정", "강", "조", "윤", "장", "임", "한", "오", "서", "신", "권", "황", "안",
//				"송", "류", "전", "홍", "고", "문", "양", "손", "배", "조", "백", "허", "유", "남", "심", "노", "정", "하", "곽", "성", "차",
//				"주", "우", "구", "신", "임", "나", "전", "민", "유", "진", "지", "엄", "채", "원", "천", "방", "공", "강", "현", "함", "변",
//				"염", "양", "변", "여", "추", "노", "도", "소", "신", "석", "선", "설", "마", "길", "주", "연", "방", "위", "표", "명", "기",
//				"반", "왕", "금", "옥", "육", "인", "맹", "제", "모", "장", "남", "탁", "국", "여", "진", "어", "은", "편", "구", "용" };
//
//		String[] name = { "서연", "서윤", "지우", "서현", "민서", "하은", "하윤", "윤서", "지유", "지민", "채원", "지윤", "은서", "수아", "다은",
//				"예은", "지아", "수빈", "소율", "예린", "예원", "지원", "소윤", "지안", "하린", "시은", "유진", "채은", "윤아", "유나", "가은", "서영",
//				"민지", "예진", "서아", "수민", "수연", "연우", "예나", "예서", "주아", "시연", "연서", "하율", "다인", "다연", "시아", "아인", "현서",
//				"서은", "유주", "아린", "서우", "하연", "서율", "서진", "채윤", "유빈", "지율", "나윤", "수현", "예지", "다현", "소은", "나은", "나연",
//				"지은", "민주", "아윤", "사랑", "시현", "예빈", "윤지", "서하", "지현", "소연", "혜원", "지수", "은채", "주하", "채아", "승아", "다윤",
//				"소민", "서희", "나현", "민아", "채린", "하영", "세아", "세은", "도연", "규리", "아영", "다온", "가윤", "지연", "예림", "태희", "민채",
//				"민준", "서준", "예준", "도윤", "시우", "주원", "하준", "지호", "지후", "준서", "준우", "현우", "도현", "지훈", "건우", "우진", "선우",
//				"서진", "민재", "현준", "연우", "유준", "정우", "승우", "승현", "시윤", "준혁", "은우", "지환", "승민", "지우", "유찬", "윤우", "민성",
//				"준영", "시후", "진우", "지원", "수현", "재윤", "시현", "동현", "수호", "태윤", "민규", "재원", "한결", "민우", "재민", "은찬", "윤호",
//				"시원", "이준", "민찬", "지안", "시온", "성민", "준호", "승준", "성현", "이안", "현서", "재현", "하율", "지한", "우빈", "태민", "지성",
//				"예성", "민호", "태현", "지율", "민혁", "서우", "성준", "은호", "규민", "정민", "준", "지민", "윤성", "율", "윤재", "하람", "하진",
//				"민석", "준수", "은성", "태양", "예찬", "준희", "도훈", "하민", "준성", "건", "지완", "현수", "승원", "강민", "정현" };

		String[] name = { "이주아", "연지환", "오지원", "장도훈", "오하율", "방한결", "백민우", "권주하", "구예진", "여혜원", "구유나", "남민석", "용현수",
				"안민성", "현준영", "현하율", "조다인", "강주아", "공지윤", "길민서", "구민규", "신민채", "여지성", "최하람", "탁서희", "구승현", "천다연", "반은호",
				"유서아", "변윤성", "허유진", "박채원", "류소연", "남연우", "안강민", "육정민", "송승현", "제수아", "오재원", "황지윤", "진윤우", "지도연", "유이안",
				"구태윤", "공한결", "노시아", "변민재", "설현서", "채예진", "주서현", "장다연", "권채윤", "한사랑", "천준호", "구수아", "홍진우", "맹윤성", "신혜원",
				"노민호", "엄승우", "양소은", "노수빈", "추주하", "성진우", "허지환", "손시윤", "남수호", "전도윤", "조은서", "현성현", "정주하", "천하민", "반도현",
				"유지수", "서하연", "선주원", "편다온", "강현준", "설예은", "김준우", "하다은", "모승아", "류하율", "윤예림", "탁시원", "어도윤", "고유진", "구서하",
				"백수아", "서나은", "연나연", "권은서", "양건", "전아영", "은아린", "권도훈", "유지안", "하규민", "금민호", "설정우" };

		String[] tel = { "01063184671", "01008577472", "01028692362", "01079467478", "01078355208",
				"01035795386", "01091036763", "01064867030", "01039298655", "01092186622", "01061191134",
				"01080397529", "01044354749", "01086804736", "01006386711", "01097581021", "01033665925",
				"01040544549", "01080498919", "01081850258", "01064123449", "01075170475", "01038540598",
				"01095379253", "01018587794", "01065589157", "01058585964", "01093808735", "01080276314",
				"01009280583", "01031273396", "01053505910", "01093983706", "01030535250", "01001148330",
				"01089828733", "01080770198", "01006227988", "01076353258", "01060422551", "01060723835",
				"01041995481", "01069543454", "01071030000", "01006995387", "01096476629", "01028282046",
				"01094145130", "01028684413", "01099248047", "01003103027", "01036444087", "01015222443",
				"01049905996", "01036303519", "01017598284", "01077428006", "01060484245", "01074535731",
				"01092831799", "01030499988", "01099556751", "01010678000", "01012949411", "01012680470",
				"01042512351", "01081453637", "01003997572", "01071708307", "01010094191", "01044391824",
				"01088108478", "01059315018", "01065639801", "01025404468", "01063130035", "01037640566",
				"01025929203", "01094605410", "01092497811", "01088905948", "01060827295", "01098002196",
				"01090410686", "01045725230", "01026264264", "01005829344", "01080613822", "01021249334",
				"01051297892", "01009504633", "01063459959", "01043050933", "01044596266", "01028879651",
				"01087138447", "01072446318", "01038404937", "01035326210", "01071961280", "01092508829",
				"01070235480", "01097661953", "01037703888", "01092389528", "01053081557", "01027452759",
				"01090555526", "01022182126", "01034598284", "01067367650", "01002011301", "01035068989",
				"01078417342", "01077304507", "01095797196", "01073274878", "01001060438", "01099983744",
				"01087727551", "01005891049", "01039770361", "01055347999", "01022440386", "01053289999",
				"01087075194", "01099489377", "01092231050", "01040527065", "01097516902", "01018631643",
				"01087517315", "01005019088", "01029446868", "01013989038", "01058374171", "01037095450",
				"01044257780", "01029718394", "01052449487", "01083389892", "01078019774", "01020935252",
				"01003438473", "01048186349", "01061127245", "01052144801", "01024552442", "01071803405",
				"01065721389", "01078999266", "01015411373", "01078627488", "01025551759", "01011931880",
				"01027135034", "01060974984", "01043129439", "01093747700", "01023797656", "01097251076",
				"01097918786", "01002709965", "01077861683", "01037263534", "01039070449", "01007553852",
				"01081544077", "01057508306", "01023197440", "01091630795", "01061382414", "01042046494",
				"01059831044", "01074581291", "01050675778", "01004788059", "01009625255", "01037934677",
				"01055984407", "01006932036", "01023565910", "01028785006", "01023435878", "01091752848",
				"01003236588", "01075669379", "01030388622", "01078589456", "01037928896", "01015915873",
				"01017870684", "01087554150", "01067060318", "01023670398", "01065221091", "01057771070",
				"01041595082", "01003474525", "01072441084" };

		String[] id = { "ZPZXcM96", "mmquXK1", "LcLRwe50", "lFRmhv70", "HfNumC5", "DxwJLN36", "rAdNmU83", "jKADZq62",
				"JjuzMc54", "ylCDhy28", "xAcIfp50", "TRUZcw47", "sCUGqK31", "xtkyBS23", "izDRIg91", "MnFekt54",
				"uQwYWC21", "AxqCyj78", "KHyuCR19", "HuLawb34", "GFnnnz4", "lQwpcZ8", "HKRwti48", "oUbdiS15",
				"nhltvV92", "EGQCgo69", "stMHoY57", "OnSyMy63", "qoForg2", "HUyAxA18", "CszIdt71", "thiTgD2",
				"QvclDh31", "fbCNzz57", "xvLStT52", "WGYyvY5", "VcCKQT98", "vhJfbN43", "ORfefc55", "Pwcrca95",
				"tKwEtc93", "MsOJhl2", "tXTGpz58", "OmbDTH57", "SUcqXo58", "XMetcS55", "JQWUWJ79", "MeljbP9",
				"qMLIYx19", "hefQKi85", "YBhybx6", "fbUimA74", "afuefa20", "YBjEPC91", "qNPoLA84", "zvShau1",
				"bkgJBR45", "XIiJNw30", "QVafbM16", "KbFhhF38", "lQkohB16", "EWbOSc17", "SQDeXF9", "AbQwAh54",
				"qxzWQm79", "IVKlSN52", "LajxLJ46", "ivuBpC56", "OmHlvU9", "QNKzQS44", "LOjFKT25", "BHwhXU89",
				"dNuQNk45", "vQlBOl46", "rWAyGC8", "gucsSC54", "QOlQIo37", "DEHnPX94", "ePxWXV35", "jQfwTn87",
				"TFcGOt89", "JvYOPC80", "DMMjjg28", "KoeOzS82", "vMJtbw4", "nbbSJN28", "Orlhcq94", "fveYVv86",
				"YtvqHZ6", "TpmRPk57", "cytCXL45", "rLcDQA64", "KlrAVL43", "brBWSb57", "WfkAkg85", "HHdCDk47",
				"fPshql25", "OiXFkI65", "cHNkTy57", "bqNIAx45" };

		String[] pw = { "CWPiR8843", "ZJe1565", "tMoXL2324", "Jok2726", "vRa9228", "gTPF8781", "wxzh4884", "lKTSR5418",
				"fGg6690", "eMrA7332", "VtLPKF1273", "VOACM2474", "ZPHg7313", "BLDj4760", "xLgP1898", "UQuZ6599",
				"YGtqi8741", "bxHlY8077", "wlrO3999", "rBrS2543", "JYwee9704", "jSoIu4504", "lZxOU1818", "tCLt7183",
				"UAsQkK8738", "fYiA1769", "nDj9905", "iAtl3267", "FEnpYf9686", "GtkN1169", "TXHa5008", "pORG1285",
				"SCSdc1379", "SHt5385", "mQCa9525", "iBVpZ6917", "OsJStA1082", "IMWm2281", "CYoXSl6090", "NOCI6374",
				"Pjt2438", "OnV9592", "kcC4130", "FMJiR7584", "njPGr3217", "CmpW4778", "wXmNS7865", "mkjtI6900",
				"AwF5979", "QGqH6890", "lzJ7161", "uvM2864", "nfk6929", "wWZ9911", "bYMe9527", "Qfiv4745", "HPp4084",
				"NwFE1259", "GTHE7179", "Czf9207", "VbxZy7842", "QqJ8805", "filMHV7273", "EeK3818", "TXZ9353",
				"mbTcK3044", "PJQlk7229", "NgWc2938", "HphROc4000", "lYCD4987", "xTZY1583", "JVFY9622", "kPWahh9556",
				"DogDlX2267", "yDGg5551", "Nxu8433", "rhux2977", "FmVX6283", "OyQno2117", "koQu6069", "mvtn4437",
				"DHZ3334", "fMVPig3243", "wjBv7592", "fXj9961", "xMC4740", "nQbV2075", "oKlgx1030", "HKdd6090",
				"BMji5179", "FZpl4631", "QaZG9382", "aUAya1477", "ZOa8445", "pkt7105", "EIqbkh4122", "SUxtzM2773",
				"GeJyGS6123", "hLmQ8586", "pEcZb4670" };
		String[] gender = { "w", "m", "w", "m", "w", "m", "m", "w", "w", "w", "w", "m", "m", "m", "m", "w", "w", "w",
				"w", "w", "m", "m", "w", "w", "w", "m", "w", "m", "w", "m", "w", "w", "w", "m", "m", "m", "m", "w", "m",
				"w", "m", "w", "m", "m", "m", "w", "m", "w", "w", "w", "w", "w", "w", "m", "w", "m", "m", "w", "m", "m",
				"w", "w", "w", "m", "m", "w", "m", "m", "w", "m", "m", "m", "m", "w", "w", "m", "w", "m", "w", "m", "w",
				"w", "w", "w", "m", "m", "w", "w", "w", "w", "w", "w", "m", "w", "w", "m", "w", "m", "m", "m", };

		String[] birth = { "2002-05-25", "2004-07-17", "2001-08-03", "1989-01-02", "1980-03-01", "1978-04-21",
				"1971-05-31", "1972-01-31", "2007-05-08", "1977-10-12", "2008-08-04", "2008-10-02", "1971-04-30",
				"2001-12-26", "1993-07-02", "1978-10-16", "1975-02-28", "1971-05-14", "1980-06-28", "1976-09-02",
				"1975-03-04", "1994-12-20", "1973-12-13", "1997-05-14", "1981-10-18", "1996-01-16", "1993-08-11",
				"1999-05-02", "2005-11-24", "1975-05-15", "1993-01-10", "1970-10-28", "2010-03-04", "2004-11-12",
				"1993-05-07", "1996-09-20", "2010-03-13", "1988-02-05", "1970-02-04", "1976-10-26", "1993-01-06",
				"2001-07-08", "1992-05-31", "1972-08-01", "2004-06-06", "1984-09-01", "1972-03-07", "1993-10-26",
				"1978-08-27", "1974-04-08", "1975-06-27", "1987-03-01", "1981-05-08", "1980-10-24", "2001-06-11",
				"1972-02-05", "2006-09-27", "2009-07-28", "1995-04-28", "1998-09-06", "1995-02-14", "1989-10-15",
				"1990-08-31", "1999-02-21", "2010-03-29", "1973-02-06", "1978-07-20", "1990-02-04", "1971-06-17",
				"1999-05-02", "1975-01-08", "1973-12-20", "1977-01-09", "1994-12-08", "1972-01-01", "1972-02-12",
				"2009-06-01", "1993-11-28", "2004-05-24", "1999-11-14", "1982-03-22", "2006-11-16", "1976-04-04",
				"1979-10-26", "2001-10-12", "1977-12-26", "2006-12-24", "1982-04-14", "1985-06-30", "1997-11-06",
				"1988-06-28", "1977-10-18", "1971-10-29", "2000-12-16", "1983-01-13", "2000-06-10", "1984-09-27",
				"1996-04-29", "1977-04-15", "1992-03-07" };

		String[] email = { "ZPZXcM96@gmail.com", "mmquXK1@daum.net", "LcLRwe50@gmail.com", "lFRmhv70@naver.com",
				"HfNumC5@nate.com", "DxwJLN36@nate.com", "rAdNmU83@gmail.com", "jKADZq62@daum.net",
				"JjuzMc54@naver.com", "ylCDhy28@nate.com", "xAcIfp50@nate.com", "TRUZcw47@daum.net",
				"sCUGqK31@nate.com", "xtkyBS23@gmail.com", "izDRIg91@daum.net", "MnFekt54@nate.com",
				"uQwYWC21@gmail.com", "AxqCyj78@nate.com", "KHyuCR19@naver.com", "HuLawb34@naver.com",
				"GFnnnz4@gmail.com", "lQwpcZ8@gmail.com", "HKRwti48@gmail.com", "oUbdiS15@gmail.com",
				"nhltvV92@gmail.com", "EGQCgo69@gmail.com", "stMHoY57@gmail.com", "OnSyMy63@naver.com",
				"qoForg2@nate.com", "HUyAxA18@gmail.com", "CszIdt71@daum.net", "thiTgD2@naver.com", "QvclDh31@daum.net",
				"fbCNzz57@gmail.com", "xvLStT52@naver.com", "WGYyvY5@gmail.com", "VcCKQT98@naver.com",
				"vhJfbN43@gmail.com", "ORfefc55@nate.com", "Pwcrca95@naver.com", "tKwEtc93@gmail.com",
				"MsOJhl2@nate.com", "tXTGpz58@naver.com", "OmbDTH57@gmail.com", "SUcqXo58@gmail.com",
				"XMetcS55@nate.com", "JQWUWJ79@nate.com", "MeljbP9@daum.net", "qMLIYx19@daum.net", "hefQKi85@gmail.com",
				"YBhybx6@daum.net", "fbUimA74@naver.com", "afuefa20@nate.com", "YBjEPC91@nate.com",
				"qNPoLA84@naver.com", "zvShau1@nate.com", "bkgJBR45@daum.net", "XIiJNw30@daum.net", "QVafbM16@nate.com",
				"KbFhhF38@naver.com", "lQkohB16@naver.com", "EWbOSc17@naver.com", "SQDeXF9@naver.com",
				"AbQwAh54@naver.com", "qxzWQm79@daum.net", "IVKlSN52@gmail.com", "LajxLJ46@nate.com",
				"ivuBpC56@gmail.com", "OmHlvU9@daum.net", "QNKzQS44@gmail.com", "LOjFKT25@daum.net",
				"BHwhXU89@gmail.com", "dNuQNk45@daum.net", "vQlBOl46@nate.com", "rWAyGC8@nate.com",
				"gucsSC54@naver.com", "QOlQIo37@naver.com", "DEHnPX94@naver.com", "ePxWXV35@nate.com",
				"jQfwTn87@nate.com", "TFcGOt89@naver.com", "JvYOPC80@nate.com", "DMMjjg28@gmail.com",
				"KoeOzS82@daum.net", "vMJtbw4@nate.com", "nbbSJN28@gmail.com", "Orlhcq94@naver.com",
				"fveYVv86@gmail.com", "YtvqHZ6@naver.com", "TpmRPk57@naver.com", "cytCXL45@gmail.com",
				"rLcDQA64@nate.com", "KlrAVL43@gmail.com", "brBWSb57@nate.com", "WfkAkg85@gmail.com",
				"HHdCDk47@nate.com", "fPshql25@nate.com", "OiXFkI65@daum.net", "cHNkTy57@naver.com",
				"bqNIAx45@gmail.com" };

		int[] grade = { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
				1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
				1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 };

		int[] point = { 2000, 0, 1000, 5000, 0, 6000, 900, 0, 4000, 0, 700, 500, 6000, 0, 0, 700, 900, 2000, 1000, 0, 0,
				1000, 4000, 1000, 0, 0, 700, 4000, 0, 4000, 6000, 0, 0, 0, 700, 900, 1000, 0, 5000, 700, 10000, 0, 0,
				3000, 10000, 4000, 0, 0, 6000, 5000, 0, 6000, 0, 2000, 1000, 1000, 0, 5000, 5000, 0, 500, 500, 900, 0,
				4000, 5000, 2000, 10000, 0, 2000, 500, 0, 10000, 1000, 700, 0, 6000, 1000, 0, 5000, 500, 0, 4000, 1000,
				0, 6000, 0, 6000, 5000, 3000, 10000, 0, 3000, 0, 4000, 6000, 900, 0, 0, 4000 };
		
		String[] genre = { "판타지", "다큐", "애니메이션", "판타지", "SF", "로맨스", "스릴러", "애니메이션", "성인", "다큐", "공포", "액션", "SF",
				"스릴러", "다큐", "SF", "판타지", "코미디", "성인", "SF", "판타지", "로맨스", "판타지", "로맨스", "공포", "판타지", "애니메이션", "공포",
				"성인", "스릴러", "SF", "공포", "공포", "로맨스", "코미디", "코미디", "애니메이션", "판타지", "다큐", "스릴러", "성인", "다큐", "코미디",
				"다큐", "다큐", "SF", "SF", "SF", "액션", "애니메이션", "판타지", "로맨스", "스릴러", "성인", "애니메이션", "판타지", "코미디", "액션",
				"판타지", "코미디", "성인", "애니메이션", "액션", "액션", "성인", "SF", "로맨스", "액션", "로맨스", "스릴러", "코미디", "스릴러", "애니메이션",
				"액션", "다큐", "다큐", "공포", "SF", "코미디", "SF", "SF", "스릴러", "애니메이션", "공포", "코미디", "스릴러", "스릴러", "애니메이션",
				"SF", "애니메이션", "로맨스", "공포", "성인", "코미디", "액션", "애니메이션", "애니메이션", "로맨스", "로맨스", "다큐" };

		String[] theater = { "강남", "강남대로(씨티)", "강동", "군자", "동대문", "마곡", "목동", "상봉", "상암월드컵경기장", "성수", "센트럴", "송파파크하비오",
				"신촌", "이수", "창동", "코엑스", "홍대", "화곡", "ARTNINE", "고양스타필드", "김포한강신도시", "남양주", "남양주현대아울렛 스페이스원", "동탄",
				"미사강변", "백석", "별내", "부천스타필드시티", "분당", "수원", "수원남문", "시흥배곧", "안산중앙", "안성스타필드", "양주", "영통", "용인기흥",
				"용인테크노밸리", "의정부민락", "일산", "일산벨라시타", "킨텍스", "파주금촌", "파주운정", "파주출판도시", "하남스타필드", "검단", "송도", "영종", "인천논현",
				"청라지젤", "공주", "논산", "대전", "대전유성", "대전중앙로", "대전현대아울렛", "세종(조치원)", "세종나성", "세종청사", "오창", "제천", "진천", "천안",
				"청주사창", "충주", "홍성내포", "경북도청", "경산하양", "구미강동", "김천", "남포항", "대구(칠성로)", "대구신세계(동대구)", "대구이시아", "덕천", "마산",
				"문경", "부산극장", "부산대", "북대구(칠곡)", "삼천포", "양산", "양산라피에스타", "울산", "정관", "창원", "창원내서", "해운대(장산)", "광주상무",
				"광주하남", "목포하당(포르모)", "송천", "순천", "여수웅천", "전대(광주)", "전주혁신", "첨단", "남춘천", "속초", "원주", "원주센트럴" };

//나의 보물 제 1호는?   value 1 번
//나의 좌우명은? value 2번
//나의 어렸을 적 살던곳은? value 3번
//내가 존경하는 인물은? value 4번
//나의 가장 친한친구의 이름은? value 5번
//초등학교 시절 나의 꿈은? value  6번
		int[] question = { 1, 1, 4, 2, 3, 5, 6, 2, 1, 3, 2, 6, 1, 3, 4, 4, 3, 2, 6, 3, 4, 6, 6, 4, 2, 5, 6, 3, 2, 3, 5,
				1, 2, 4, 6, 5, 5, 6, 5, 3, 2, 5, 1, 5, 2, 2, 6, 2, 5, 3, 5, 6, 1, 5, 5, 1, 4, 4, 4, 5, 5, 2, 2, 3, 6, 4,
				4, 6, 4, 5, 1, 4, 6, 5, 5, 5, 6, 5, 1, 4, 4, 5, 5, 5, 2, 5, 1, 6, 4, 1, 3, 2, 3, 2, 5, 5, 3, 3, 2, 6 };

		String[] answer = { "가족", "친구", "엄마", "후회하지 않는 사람이 되자.", "시골", "박민준", "파일럿", "후회하지 않는 사람이 되자.", "가족", "시골",
				"현재에 충실하며 내일을 준비하자.", "과학자", "가족", "부산", "엄마", "아빠", "시골", "현재에 충실하며 내일을 준비하자.", "파일럿", "도시", "운동선수",
				"선생님", "공무원", "엄마", "흐르는 물처럼 살자.", "한소희", "공무원", "서울", "앞만 보고 가자, 내 인생에 뒤란 없다.", "서울", "박찬호", "가족",
				"후회하지 않는 사람이 되자.", "아빠", "건축가", "박민준", "박찬호", "선생님", "박찬호", "시골", "화합은 하지만 부화뇌동은 하지 않는다.", "한소희", "가족",
				"박민준", "화합은 하지만 부화뇌동은 하지 않는다.", "앞만 보고 가자, 내 인생에 뒤란 없다.", "프로그래머", "흐르는 물처럼 살자.", "박찬호", "부산", "한소희",
				"프로그래머", "가족", "한소희", "박민준", "가족", "독립운동가", "엄마", "운동선수", "안상태", "박민준", "흐르는 물처럼 살자.",
				"현재에 충실하며 내일을 준비하자.", "도시", "경찰", "운동선수", "엄마", "대통령", "독립운동가", "박찬호", "강아지", "운동선수", "선생님", "박민준",
				"안상태", "김은혜", "프로그래머", "김은혜", "강아지", "아빠", "아빠", "김은혜", "김은혜", "박찬호", "앞만 보고 가자, 내 인생에 뒤란 없다.", "박민준",
				"가족", "선생님", "독립운동가", "가족", "서울", "현재에 충실하며 내일을 준비하자.", "도시", "앞만 보고 가자, 내 인생에 뒤란 없다.", "박민준", "김은혜",
				"부산", "부산", "후회하지 않는 사람이 되자.", "프로그래머" };

		String[] profile = { "/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png",
				"/images/profile.png", "/images/profile.png", "/images/profile.png", "/images/profile.png" };

		int[] lv = { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
				1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
				1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 };


//		for (int i = 0; i < 100; i++) {
//			Calendar cal = Calendar.getInstance();
//
//			cal.set(2019, 0, 1);
//			cal.add(Calendar.DATE, rnd.nextInt(500));
//			String regda = String.format("%tF", cal);
//
//			System.out.printf(
//					"insert into tblUser values(seqUser.nextVal,'%s','%s','%s','%s','%s','%s','%s',%d,%d,'%s','%s',%d,'%s','%s',%d,'%s');"
//							+ "\n",
//					name[i], tel[i], id[i], pw[i],gender[i], birth[i], email[i], grade[i], point[i], genre[i], theater[i],
//					question[i], answer[i], profile[i], lv[i], regda);
//
//		}
		
		
		
		for(int i=0;i<theater.length;i++) {
			System.out.println("<option value=\""+theater[i]+"\">"+theater[i]+"</option>");
			
		}

		
	}
}
